src/QuanLyDiemComApp/src/jbiasa/QuanLyDiemComApp.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="QuanLyDiemComApp"
             xmlns:tns="QuanLyDiemComApp" xmlns:ns="http://j2ee.netbeans.org/wsdl/QuanLyDiem/TaoLoaiDiem" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://j2ee.netbeans.org/wsdl/QuanLyDiem/TaoSoDiem" xmlns:ns2="http://j2ee.netbeans.org/wsdl/QuanLyDiem/NhapDiem">
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyDiem/TaoLoaiDiem" location="../jbiServiceUnits/QuanLyDiem/interface_WSDL/TaoLoaiDiem.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyDiem/TaoSoDiem" location="../jbiServiceUnits/QuanLyDiem/interface_WSDL/TaoSoDiem.wsdl"/>
    <import namespace="http://j2ee.netbeans.org/wsdl/QuanLyDiem/NhapDiem" location="../jbiServiceUnits/QuanLyDiem/interface_WSDL/NhapDiem.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:TaoLoaiDiemPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="TaoLoaiDiemOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QuanLyDiemComApp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QuanLyDiemComApp"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding2" type="ns1:TaoSoDiemPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="TaoSoDiemOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QuanLyDiemComApp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QuanLyDiemComApp"/>
            </output>
        </operation>
    </binding>
    <binding name="casaBinding3" type="ns2:NhapDiemPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="NhapDiemOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="QuanLyDiemComApp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="QuanLyDiemComApp"/>
            </output>
        </operation>
    </binding>
    <service name="QuanLyDiemComAppService1">
        <port name="TaoLoaiDiem" binding="tns:casaBinding1">
            <soap:address location="http://localhost:18001/QuanLyDiemComApp/TaoLoaiDiem"/>
        </port>
    </service>
    <service name="QuanLyDiemComAppService2">
        <port name="TaoSoDiem" binding="tns:casaBinding2">
            <soap:address location="http://localhost:18001/QuanLyDiemComApp/TaoSoDiem"/>
        </port>
    </service>
    <service name="QuanLyDiemComAppService3">
        <port name="NhapDiem" binding="tns:casaBinding3">
            <soap:address location="http://localhost:18001/QuanLyDiemComApp/NhapDiem"/>
        </port>
    </service>
</definitions>


