trunk/src/QuanLyDiemComApp/test/TestNhapDiem/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:quan="QuanLyDiemComApp" xmlns:loa="http://xml.netbeans.org/schema/LoaiDiem">
  <soapenv:Body>
    <quan:NhapDiemOperation>
      <listDiem>
        <!--Zero or more repetitions:-->
        <loa:Diem>
          <loa:id_diem>32</loa:id_diem>
          <loa:diem>9</loa:diem>
          <loa:id_loaidiem>1</loa:id_loaidiem>
          <loa:id_chitietsodiem>11</loa:id_chitietsodiem>
        </loa:Diem>
        <loa:Diem>
          <loa:id_diem>33</loa:id_diem>
          <loa:diem>8</loa:diem>
          <loa:id_loaidiem>1</loa:id_loaidiem>
          <loa:id_chitietsodiem>11</loa:id_chitietsodiem>
        </loa:Diem>
      </listDiem>
    </quan:NhapDiemOperation>
  </soapenv:Body>
</soapenv:Envelope>